## **Data Input and Output**

In [3]:
import pandas as pd

## **CSV**

### CSV Input

In [4]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv('example')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [9]:
df.to_csv('My_output',index=False)

In [10]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### **Excel**

- Pandas can read and write excel files - it can only import data.
- It cannot import formulas, images or macros causing `read_excel()` to crash.

### Excel Input

In [16]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Excel Output

In [17]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

## **HTML**

- Pandas can read table tabs off of HTML.

### HTML Input

`read_html()` will read tables off of a webpage and return a list of DataFrame objects.

In [4]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [5]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Metropolitan Capital Bank & Trust,Chicago,Illinois,57488,First Independence Bank,"January 30, 2026",10550
1,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
2,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
3,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
4,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546